{
    "Dry": {
        "Medical Ingredients": {
            "Hyaluronic Acid": "It helps retain moisture in the skin by attracting water and is commonly found in moisturizers for dry skin.",
            "Ceramides": "These are lipids that help maintain the skin's barrier and lock in moisture, preventing dryness.",
            "Urea": "Urea is a humectant that helps the skin hold onto water and also has exfoliating properties to remove dead skin cells.",
            "Glycerin": "Glycerin pulls moisture from the environment into the skin, helping it stay hydrated.",
            "Shea Butter": "This natural fat derived from the shea tree is an emollient that provides deep hydration and nourishment for dry skin.",
            "Lanolin": "This ingredient mimics the skin’s natural oils and provides a protective barrier to help retain moisture.",
            "Petrolatum": "A strong occlusive that seals moisture into the skin, preventing further water loss."
        },
        "Diet": {
            "Omega-3 Fatty Acids": "These are found in fatty fish (like salmon, mackerel, and sardines), flaxseeds, chia seeds, and walnuts. Omega-3s help maintain the skin’s lipid barrier, which is essential for moisture retention.",
            "Avocados": "Rich in healthy fats and vitamin E, avocados can help keep skin supple and moisturized.",
            "Water": "Drinking enough water is critical for maintaining skin hydration. Aim for at least 8 glasses a day to keep your skin from drying out.",
            "Herbal Teas": "Green tea and other herbal teas contain antioxidants that can improve skin health while keeping you hydrated.",
            "Vitamin E": "Found in nuts, seeds, and spinach, vitamin E helps protect the skin from oxidative damage and keeps it moisturized.",
            "Vitamin C": "This powerful antioxidant (in citrus fruits, strawberries, bell peppers) helps with collagen production and can reduce skin dryness.",
            "Beta-Carotene": "Found in carrots, sweet potatoes, and spinach, beta-carotene converts into vitamin A, which is important for skin health.",
            "Zinc": "Shellfish, pumpkin seeds, and legumes contain zinc, which supports skin repair and keeps skin supple.",
            "Bone Broth": "Rich in collagen, bone broth can help improve skin elasticity and hydration over time.",
            "Soy Products": "Soy contains isoflavones, which can help improve skin texture and retain moisture.",
            "Yogurt and fermented foods": "These can improve gut health, which is linked to overall skin health, potentially reducing skin dryness and irritation."
        },
        "Lifestyle": {
            "Use a Humidifier": "Especially in colder months or dry climates, using a humidifier adds moisture to the air, preventing your skin from drying out.",
            "Avoid Hot Water": "Long, hot showers strip the skin of its natural oils. Opt for lukewarm water and limit your shower time to 5-10 minutes.",
            "Use Gentle Soaps": "Choose fragrance-free, mild cleansers that don’t strip your skin’s natural moisture barrier.",
            "Apply Moisturizer on Damp Skin": "After a shower or washing your hands, apply a thick moisturizer while your skin is still damp to lock in moisture.",
            "Avoid Irritating Materials": "Clothes made of wool or synthetic fibers can irritate dry skin. Opt for soft, natural fabrics like cotton that allow your skin to breathe.",
            "Use Hypoallergenic Detergents": "Harsh laundry detergents can worsen dryness. Look for products that are free of dyes and fragrances.",
            "Wear Gloves in Cold Weather": "Cold air can exacerbate dry skin, especially on your hands. Wear gloves when outside in the winter.",
            "Manage Stress Levels": "Chronic stress can impact your skin health which sometimes cause dry patches. Incorporating relaxation techniques like meditation, yoga, or regular exercise can support skin health.",
            "Limit Exfoliation": "Over-exfoliating can strip away your skin’s natural oils and worsen dryness. Opt for gentle exfoliants and use them sparingly (e.g., once a week).",
            "Stay Hydrated": "Keeping your body hydrated internally helps maintain skin hydration as well."
        }
    },
    "Oily": {
        "Medical Ingredients": {
            "Salicylic Acid": "his beta-hydroxy acid (BHA) penetrates into pores to help remove excess oil and dead skin cells, preventing breakouts and clogged pores.",
            "Niacinamide": "Niacinamide helps regulate sebum production and reduce inflammation, making it great for controlling oiliness without over-drying. It also minimizes the appearance of pores and improves overall skin texture.",
            "Benzoyl Peroxide": "Benzoyl peroxide helps reduce oil and kill acne-causing bacteria on the skin. It’s effective for treating and preventing breakouts.",
            "Alpha-Hydroxy Acids": "AHAs, like glycolic acid or lactic acid, exfoliate the skin’s surface, removing dead cells and helping to clear excess oil and dirt from the pores.",
            "Clay": "Clays absorb excess oil and mattify the skin. Masks or cleansers with kaolin or bentonite clay can help control shine and prevent clogged pores.",
            "Retinoids": "Retinoids help regulate oil production and speed up cell turnover, preventing clogged pores and reducing breakouts. They also improve skin texture and reduce the appearance of large pores.",
            "Zinc": "Zinc has anti-inflammatory and oil-regulating properties. It’s often found in topical creams and sunscreens for oily skin.",
            "Sulfur": "Sulfur helps absorb excess oil while also having antimicrobial properties, making it useful for treating acne without irritating the skin.",
            "Tea Tree Oil": "A natural antiseptic and anti-inflammatory ingredient, tea tree oil can reduce oiliness while also fighting acne-causing bacteria.",
            "Witch Hazel": "Witch hazel is an astringent that can help reduce excess oil, tighten pores, and soothe the skin.",
            "Hyaluronic Acid": "Although hyaluronic acid is known for hydrating, it’s great for oily skin because it provides moisture without adding extra oil, helping to balance the skin."
        },
        "Diet": {
            "Omega-3 Fatty Acids": "Omega-3s have anti-inflammatory properties that help balance oil production and reduce acne. They can also improve skin hydration without causing excess oil. Sources include fatty fish (salmon, mackerel, sardines), flaxseeds, chia seeds, walnuts.",
            "Antioxidants": "Antioxidants help reduce inflammation and combat oxidative stress, which can worsen oily skin and lead to breakouts. Sources include berries (blueberries, strawberries), leafy greens (spinach, kale), nuts, seeds, and green tea.",
            "Low-Glycemic Foods": "High-glycemic foods (those that cause spikes in blood sugar) can increase insulin levels, which may trigger excess oil production and acne. Eating low-glycemic foods helps regulate insulin levels, potentially reducing oiliness. Sources include whole grains (quinoa, oats, brown rice), legumes, vegetables (especially non-starchy ones like leafy greens, broccoli, and zucchini).",
            "Limit Dairy Consumption": "Some studies suggest that dairy, particularly skim milk, may be linked to acne and excess sebum production. This is due to the hormones found in dairy that can affect the skin’s oil production. Alternatives include plant-based milk (almond, soy, oat milk).",
            "Zinc-Rich Foods": "Zinc helps control sebum production and can reduce the severity of acne. It’s also involved in skin repair. Sources include shellfish, pumpkin seeds, chickpeas, cashews, and quinoa.",
            "Probiotics": "A healthy gut microbiome can influence skin health. Probiotics help regulate inflammation, potentially reducing acne and excess oil. Sources include yogurt with live cultures, kefir, sauerkraut, kimchi, and other fermented foods.",
            "Green Tea": "Green tea contains powerful antioxidants called catechins that help regulate oil production and reduce inflammation. Some studies have shown that drinking green tea can reduce sebum output.",
            "Water": "Drinking enough water helps maintain overall skin health and hydration. While oily skin produces excess sebum, it still needs hydration to stay balanced.",
            "Vitamin A": "Vitamin A helps reduce oil production and prevents clogged pores, which can lead to acne. It is also important for skin cell regeneration. Sources include carrots, sweet potatoes, spinach, and other orange and dark leafy vegetables.",
            "Avoid Excessive Sugars and Processed Foods": "Sugary and highly processed foods can cause inflammation and increase insulin levels, triggering more oil production and breakouts."
        },
        "Lifestyle": {
            "Cleanse Your Face Twice a Day": "Cleansing your skin in the morning and at night helps remove excess oil, dirt, and makeup. Opt for a gentle, non-comedogenic, and sulfate-free cleanser to avoid stripping the skin of its natural oils, which can lead to more oil production as a rebound effect. Washing too frequently can strip the skin and cause it to produce more oil. Stick to twice a day unless you’ve been sweating heavily.",
            "Use Oil-Free and Non-Comedogenic Products": "Choose skincare products and makeup labeled as “oil-free” and “non-comedogenic” (which means they won’t clog your pores). This includes moisturizers, sunscreens, and foundations. Even oily skin needs moisture, so opt for lightweight, gel-based moisturizers that hydrate without adding extra oil.",
            "Blot Excess Oil Throughout the Day": "Blotting papers are an easy way to remove excess oil during the day without stripping the skin. Press gently on oily areas (especially the T-zone) to reduce shine.",
            "Exfoliate Regularly (But Gently)": "Exfoliating helps remove dead skin cells and prevent clogged pores, which can contribute to oil buildup. Use gentle chemical exfoliants like salicylic acid or glycolic acid once or twice a week. Physical exfoliants (scrubs) can be too harsh and cause irritation. Exfoliating too often can lead to irritation and cause the skin to produce more oil in response.",
            "Stay Hydrated": "Drinking enough water is important for overall skin health. Dehydrated skin can trigger more oil production as your skin tries to compensate for the lack of moisture.",
            "Manage Stress Levels": "High stress levels can trigger increased sebum (oil) production, leading to more oily skin and acne. Incorporate stress management techniques like meditation, yoga, or regular exercise to help maintain balanced skin. Aim for 7-9 hours of sleep each night. Lack of sleep can disrupt hormone levels, leading to increased oil production.",
            "Exercise Regularly": "Exercise boosts circulation and helps with skin detoxification by promoting sweat, which helps unclog pores. Make sure to cleanse your face immediately after exercising to prevent breakouts from sweat and oil buildup. Remove makeup before exercising to prevent it from mixing with sweat and clogging pores.",
            "Avoid Touching Your Face": "Touching your face frequently transfers oil, bacteria, and dirt from your hands to your skin, which can clog pores and lead to more breakouts.",
            "Protect Your Skin from the Sun": "Sun damage can cause the skin to dry out, leading to more oil production as the skin compensates for the moisture loss. Use a broad-spectrum sunscreen that is oil-free and non-comedogenic to protect your skin without making it greasy. Avoid heavy or greasy sunscreens and choose lightweight, gel-based formulations designed for oily skin."
        }
    },
    "Combination": {
        "Medical Ingredients": {
            "Hyaluronic Acid": "Hyaluronic acid is a humectant that hydrates the skin without adding extra oil, making it great for balancing the dry areas while keeping the oily parts from becoming greasy. It attracts moisture to the skin and locks it in",
            "Niacinamide": "Niacinamide helps regulate oil production in the oily parts of the skin while also soothing and hydrating the dry areas. It has anti-inflammatory properties and helps minimize the appearance of pores, making it a versatile ingredient for combination skin.",
            "Salicylic Acid": "Salicylic acid is a beta-hydroxy acid (BHA) that penetrates pores to remove excess oil and dead skin cells. It is ideal for treating the oily areas of combination skin (particularly the T-zone) to prevent clogged pores and breakouts.",
            "Glycolic Acid": "Glycolic acid is an alpha-hydroxy acid (AHA) that exfoliates the skin’s surface, helping to remove dead skin cells from the dry areas while also preventing clogged pores in the oily areas. It improves skin texture and tone.",
            "Ceramides": "Ceramides are lipids that help restore the skin’s natural moisture barrier, making them perfect for hydrating dry areas while not overwhelming the oily parts. They help lock in moisture and protect the skin.",
            "Retinoids": "Retinoids regulate cell turnover, helping both dry and oily areas. They prevent clogged pores in oily areas and promote skin renewal in dry areas. Retinol (a milder form of retinoid) is a great option for combination skin to help with anti-aging and acne without over-drying.",
            "Lactic Acid": "Lactic acid is an AHA that gently exfoliates while also providing hydration, which makes it good for dry patches while still being light enough for oilier areas.",
            "Clay": "Clay helps absorb excess oil from the T-zone without over-drying the cheeks. Kaolin or bentonite clay is often found in masks designed for combination skin, as it detoxifies the skin and unclogs pores.",
            "Zinc Oxide": "Zinc oxide is a mineral found in sunscreens that is non-comedogenic, meaning it won’t clog pores. It provides sun protection and can help reduce irritation and oiliness.",
            "Tea Tree Oil": "Tea tree oil is a natural antibacterial agent that helps manage oil production and prevent breakouts in the oily areas of combination skin, particularly in the T-zone.",
            "Squalane": "Squalane is a lightweight, non-comedogenic oil that mimics the skin’s natural sebum, providing hydration without clogging pores or making oily areas greasy. It’s perfect for balancing both dry and oily zones."
        },
        "Diet": {
            "Omega-3 Fatty Acids": "Omega-3s help balance the skin’s oil production and provide hydration, which is beneficial for both the oily and dry areas of combination skin. They also have anti-inflammatory properties. Sources include fatty fish (salmon, mackerel, sardines), flaxseeds, chia seeds, walnuts, and fish oil supplements.",
            "Antioxidant": "Antioxidants help protect the skin from environmental damage and inflammation, which can worsen both dry and oily areas. They promote skin repair and renewal. Sources include berries (blueberries, strawberries, raspberries), leafy greens (spinach, kale), nuts, seeds, and brightly colored fruits and vegetables (carrots, bell peppers, tomatoes).",
            "Water": "Staying hydrated is crucial for keeping dry areas moisturized and maintaining skin elasticity. Water-rich foods help provide moisture from the inside. Sources include water, cucumbers, watermelon, oranges, celery, and lettuce.",
            "Zinc": "Zinc helps control oil production and supports the skin’s natural healing processes, making it great for both preventing breakouts in oily areas and maintaining healthy skin in dry areas. Souces include shellfish (especially oysters), pumpkin seeds, chickpeas, nuts, and whole grains.",
            "Vitamin E": "Vitamin E is a powerful antioxidant that helps repair the skin and maintain moisture levels, which is particularly beneficial for the dry areas of combination skin. Sources include almonds, sunflower seeds, avocados, spinach, and olive oil.",
            "Probiotics": "Probiotics promote a healthy gut, which can have a positive impact on the skin’s balance, helping to reduce inflammation, breakouts, and dryness. Sources include yogurt with live cultures, kefir, sauerkraut, kimchi, kombucha, and other fermented foods.",
            "Balance Your Carbohydrates with Low-Glycemic Foods": "High-glycemic foods (those that cause blood sugar spikes) can trigger excess oil production in the skin, particularly in the T-zone of combination skin. Opting for low-glycemic carbohydrates helps prevent these spikes and reduces oiliness. Sources include whole grains (brown rice, quinoa, oats), legumes (beans, lentils), and vegetables like broccoli, spinach, and carrots.",
            "Vitamin A": "Vitamin A helps regulate sebum production and skin cell turnover, balancing oily and dry areas. It also supports skin repair and renewal. Sources include carrots, sweet potatoes, spinach, kale, and other orange and green vegetables.",
            "Limit Dairy Consumption": "Some studies suggest that dairy, particularly skim milk, can contribute to increased oil production and acne in some individuals. If you notice your skin becomes oilier or breaks out after consuming dairy, consider reducing your intake. Opt for plant-based milk like almond, soy, or oat milk.",
            "Avoid Excessive Sugars and Processed Foods": "Processed and sugary foods can cause inflammation and trigger excess oil production in the oily areas, while also depriving the skin of essential nutrients needed for hydration and repair.",
            "Green Tea": "Green tea is rich in antioxidants called catechins, which can help reduce inflammation, balance oil production, and improve overall skin health.",
            "Protein": "Protein is important for the repair and regeneration of skin cells. A balanced intake of protein helps both the dry and oily areas maintain their structure and function. Sources include lean meats, poultry, fish, eggs, tofu, legumes, and nuts."
        },
        "Lifestyle": {
            "Consistent Skincare Routine": "Cleanse your face twice daily (morning and night) using a mild, sulfate-free cleanser that won't strip the skin of its natural oils or dry out the already dry areas. Avoid over-cleansing, as it can exacerbate both oily and dry patches.",
            "Exfoliate Regularly": "Exfoliating once or twice a week helps remove dead skin cells from dry areas and unclogs pores in oily areas. Use a gentle exfoliant like a chemical exfoliator with AHAs (e.g., glycolic or lactic acid) to prevent irritation. Avoid physical scrubs, which can be too harsh and may worsen dry patches.",
            "Hydrate": "Staying hydrated is essential for maintaining skin moisture levels. Aim for at least 8 glasses of water daily to keep dry areas moisturized and improve overall skin balance. If you live in a dry climate or during the colder months, using a humidifier can help keep your skin hydrated, especially the dry areas.",
            "Use Targeted Treatments": "Apply oil-controlling products such as salicylic acid or clay masks only to the T-zone or areas prone to excess oil. Avoid using these on the dry parts of your skin. Use richer, more emollient moisturizers or serums with ingredients like ceramides and hyaluronic acid on the drier parts of your skin to keep them hydrated without making the oily parts greasy.",
            "Choose Lightweight, Non-Comedogenic Products": "Opt for lightweight, non-comedogenic (won’t clog pores) moisturizers and sunscreens that won’t exacerbate the oily areas. Gel-based or water-based products often work well for combination skin. Use lightweight layers of hydration to avoid overwhelming oily areas with heavy creams.",
            "Avoid Touching Your Face": "Touching your face frequently can transfer oil, bacteria, and dirt, clogging pores and worsening the oily areas. Keeping your hands off your face minimizes breakouts in the T-zone. If you need to touch your face, wash your hands thoroughly beforehand.",
            "Manage Stress Levels": "Stress can trigger excess oil production in the T-zone and cause flare-ups of skin conditions like acne. Practice stress-relief techniques like meditation, yoga, or regular exercise to help maintain balance.",
            "Exercise Regularly": "Regular exercise promotes healthy circulation and helps flush out toxins through sweat, leading to clearer skin. However, be sure to cleanse your skin after workouts to remove sweat and oil. Always wash your face before and after working out to prevent breakouts.",
            "Use Sun Protection Daily": "Protecting your skin from UV damage is essential for maintaining healthy skin. Use an oil-free, broad-spectrum sunscreen with at least SPF 30. Sun damage can make dry areas drier and worsen oil production in oily areas. Reapply sunscreen throughout the day, especially if you're outdoors for extended periods.",
            "Avoid Over-Washing or Harsh Cleansers": "Over-washing or using harsh cleansers can strip the skin of its natural oils, causing the oily areas to produce even more oil and the dry areas to become even drier. Stick to gentle, balanced cleansers and limit washing to twice a day unless you've been sweating heavily.",
            "Opt for Oil-Blotting Papers": "Blotting papers can help manage oiliness in the T-zone without the need to wash your face multiple times a day. This is a great way to control shine without disrupting your skin’s balance. Use blotting papers as needed, particularly in the afternoon when oil production tends to increase.",
            "Get Enough Sleep": "Sleep is critical for skin regeneration and repair. Lack of sleep can increase stress hormones, which may lead to increased oil production and dehydration in the skin."
        }
    },
    "Balanced": {
        "Medical Ingredients": {
            "Hyaluronic Acid": "This ingredient helps maintain skin hydration by attracting and retaining moisture without making the skin greasy or overly dry. It's perfect for preserving the natural moisture balance in normal skin.",
            "Niacinamide": "Niacinamide improves the skin's barrier function, minimizes pores, and reduces redness. It helps maintain overall skin health by regulating oil production and improving hydration.",
            "Vitamin C": "Vitamin C is a powerful antioxidant that brightens the skin and fights free radicals that cause aging and pigmentation issues. It boosts collagen production and helps even out the skin tone.",
            "Ceramides": "Ceramides are essential lipids that restore and maintain the skin's natural moisture barrier. They lock in moisture and protect the skin from environmental irritants without making it greasy or too dry.",
            "Peptides": "Peptides are short chains of amino acids that support skin structure by stimulating collagen and elastin production. They help keep the skin firm and youthful, maintaining elasticity and smoothness.",
            "Squalane": "Squalane is a lightweight, non-comedogenic oil that mimics the skin's natural sebum. It provides moisture and acts as a protective barrier without clogging pores or making the skin greasy.",
            "Retinol": "Retinol encourages cell turnover, smooths the skin, and reduces the appearance of fine lines and wrinkles. For balanced skin, a low concentration of retinol can help maintain youthful skin and prevent premature aging.",
            "Aloe Vera": "Aloe vera has soothing and anti-inflammatory properties. It hydrates and calms the skin, helping to maintain a smooth, balanced complexion while keeping any minor irritations in check.",
            "Glycolic Acid": "Glycolic acid is an alpha-hydroxy acid (AHA) that gently exfoliates the skin, removing dead skin cells and promoting a fresh, even complexion. For balanced skin, it helps keep pores clear and smooth without causing irritation.",
            "Green Tea": "Green tea extract is an antioxidant-rich ingredient with anti-inflammatory and anti-aging properties. It helps protect the skin from environmental stressors and reduces redness.",
            "Panthenol": "Panthenol hydrates and helps repair the skin barrier. It has soothing properties that make it a great addition to a skincare routine, especially for maintaining the skin's natural moisture levels.",
            "Zinc Oxide": "Zinc oxide is a mineral sunscreen ingredient that provides broad-spectrum protection from harmful UV rays. It’s non-comedogenic and gentle, making it perfect for normal skin types to prevent sun damage without causing breakouts.",
            "Coenzyme Q10": "CoQ10 is an antioxidant that supports cellular energy production, helping the skin repair and regenerate. It’s known to reduce fine lines and wrinkles while protecting the skin from oxidative stress",
            "Lactic Acid": "Lactic acid is a mild AHA that gently exfoliates the skin and improves its texture without over-drying. It can help maintain a fresh complexion and a smooth skin surface for balanced skin types."
        },
        "Diet": {
            "Hydrate Properly": "Staying well-hydrated is essential for maintaining skin elasticity and moisture levels. Hydration helps flush out toxins and prevents dryness. Aim for at least 8 cups (about 2 liters) of water daily, and consider consuming water-rich foods.",
            "Incorporate Healthy Fats": "Healthy fats help maintain skin moisture and support its barrier function. Omega-3 and omega-6 fatty acids are particularly beneficial for skin health. Sources include fatty fish (salmon, mackerel, sardines), avocados, nuts (walnuts, almonds), seeds (chia seeds, flaxseeds), and olive oil.",
            "Antioxidant": "Antioxidants help combat free radicals and reduce inflammation, promoting healthy skin. Sources include dark chocolate, green tea, berries, nuts, and colorful fruits and vegetables.",
            "Protein": "Proteins are essential for skin repair and regeneration. They support the production of collagen and elastin, maintaining skin firmness and elasticity. Sources include lean meats (chicken, turkey), fish, eggs, legumes (beans, lentils), and low-fat dairy products.",
            "Vitamins and Minerals": "Vitamin C: Supports collagen production and skin repair. Sources include citrus fruits, strawberries, bell peppers, and broccoli. Vitamin E: Provides antioxidant protection and supports skin healing. Sources include nuts, seeds, spinach, and avocados. Zinc: Helps regulate oil production and promotes skin healing. Sources include shellfish, legumes, nuts, seeds, and whole grains.",
            "Opt for Whole Grains": "Whole grains provide fiber, which helps regulate blood sugar levels and prevent spikes that can lead to breakouts and skin issues.",
            "Limit Processed Foods and Sugars": "High-sugar and processed foods can lead to inflammation and breakouts. They may cause fluctuations in blood sugar levels, affecting overall skin health.",
            "Moderate Dairy Consumption": "Some studies suggest that dairy products may exacerbate acne in certain individuals. Monitor how your skin reacts to dairy and adjust your intake accordingly. Consider plant-based milk options (almond, soy, oat) if dairy seems to affect your skin.",
            "Green Tea": "Green tea is rich in antioxidants, particularly catechins, which have anti-inflammatory properties and can help reduce redness and irritation."
        },
        "Lifestyle": {
            "Establish a Consistent Skincare Routine": "Cleanse your skin twice a day (morning and night) with a gentle, hydrating cleanser. This removes dirt and impurities without stripping the skin of its natural oils. Use a lightweight, non-comedogenic moisturizer to hydrate the skin without clogging pores. Look for products with hydrating ingredients like hyaluronic acid or glycerin. Apply broad-spectrum sunscreen with at least SPF 30 daily, even on cloudy days, to protect against UV damage.",
            "Stay Hydrated": "Aim for at least 8 cups (about 2 liters) of water daily to keep your skin hydrated and flush out toxins. Adjust based on your activity level and climate. Include water-rich foods like cucumbers, oranges, and watermelon in your diet for added hydration.",
            "Regular Exercise": "Regular exercise improves blood flow and helps deliver oxygen and nutrients to the skin. It also aids in flushing out toxins through sweat.",
            "Manage Stress Levels": "Incorporate mindfulness practices such as meditation, deep breathing, or yoga to reduce stress, which can trigger skin issues like acne or eczema.",
            "Prioritize Sleep": "Aim for 7-9 hours of sleep per night. Sleep is crucial for skin repair and regeneration. Poor sleep can lead to dullness and premature aging.",
            "Avoid Touching Your Face": "Touching your face can transfer oil and bacteria, leading to breakouts. Keep your hands off your face and wash them frequently."
        }
    },
    "Acne/breakouts": {
        "Medical Ingredients": {
            "Beneficial": {
                "Salicylic Acid": "Helps exfoliate the skin, unclogs pores, and reduces inflammation.",
                "Benzoyl Peroxide": "Kills acne-causing bacteria and reduces excess oil.",
                "Niacinamide": "Reduces inflammation and redness, and helps regulate sebum production.",
                "Azelaic Acid": "Treats acne by reducing inflammation and bacteria while also improving skin texture.",
                "Retinoids": "Promotes cell turnover and unclogs pores.",
                "Sulfur": "Absorbs oil and helps with mild acne.",
                "Tea Tree Oil": "A natural antiseptic and anti-inflammatory ingredient, tea tree oil can reduce oiliness while also fighting acne-causing bacteria.",
                "Clay (Kaolin, Bentonite)": "Helps absorb excess oil and draws out impurities.",
                "Hyaluronic Acid": "Moisturizes without clogging pores, which is essential when using drying acne treatments."
            },
            "Harmful": {
                "Fragrance": "Can irritate sensitive or acne-prone skin.",
                "Alcohol": "Can excessively dry out skin, leading to irritation.",
                "Coconut Oil": "While hydrating, it can clog pores and worsen acne.",
                "Silicones (Dimethicone, Cyclopentasiloxane)": "Can create a film over the skin that traps oil and bacteria.",
                "Lanolin": "A common moisturizer that can clog pores for acne-prone individuals.",
                "Mineral Oil": "Heavy oils can trap debris in pores, worsening acne."
            }
        },
        "Diet": {
            "Beneficial": {
                "Low Glycemic Index (GI) Foods": "Foods like whole grains, vegetables, and legumes stabilize blood sugar levels, which can reduce acne.",
                "Antioxidant-Rich Foods": "Foods like fruits and green tea contain essential vitamins and compounds that support skin health and reduce inflammation.",
                "Omega-3 Fatty Acids": "Foods like fatty fish, flaxseeds, and walnuts help balance oil production in the skin.",
                "Probiotics": "Yogurt, kefir, and fermented foods help improve gut health, which may reduce inflammation and support overall skin health."
            },
            "Harmful": {
                "High-Glycemic Foods": "Refined carbs and sugars like white bread, pastries, and sugary beverages can spike blood sugar levels and worsen acne.",
                "Dairy Products": "Milk, especially skim milk, may be linked to increased acne due to hormones and growth factors.",
                "Processed Foods": "Highly processed snacks and fast food often contain unhealthy fats and sugars that can trigger inflammation.",
                "Saturated and Trans Fats": "Found in fried foods and baked goods, these fats can increase inflammation in the body.",
                "Excessive Sugar": "High sugar intake can promote inflammation and lead to insulin spikes, potentially worsening acne."
            }
        },
        "Lifestyle": {
            "Stress Management": "High stress can lead to increased acne breakouts, so incorporating relaxation techniques like meditation or yoga can help reduce flare-ups.",
            "Consistent Skincare Routine": "Maintaining a consistent routine with gentle cleansing, moisturizing, and appropriate treatments can help manage acne.",
            "Sufficient Sleep": "Adequate sleep supports skin repair and reduces inflammation, which can improve acne."
        }
    },
    "Rosacea": {
        "Medical Ingredients": {
            "Beneficial": {
                "Metronidazole": "Topical antibiotic commonly used to reduce redness and inflammation in rosacea.",
                "Azelaic Acid": "Helps reduce inflammation and redness associated with rosacea.",
                "Niacinamide": "Reduces inflammation and strengthens the skin barrier.",
                "Ivermectin": "Used topically to reduce inflammatory lesions in rosacea."
            },
            "Harmful": {
                "Alcohol": "Can cause skin irritation and exacerbate redness.",
                "Fragrance": "Can irritate sensitive skin and trigger flare-ups.",
                "Strong Exfoliants": "Ingredients like alpha hydroxy acids (AHAs) or physical scrubs can irritate rosacea-prone skin."
            }
        },
        "Diet": {
            "Beneficial": {
                "Anti-Inflammatory Foods": "Foods rich in omega-3 fatty acids, like salmon and walnuts, may help reduce inflammation.",
                "Antioxidant-Rich Foods": "Fruits and vegetables, especially berries and leafy greens, support overall skin health.",
                "Low-GI Foods": "Foods that stabilize blood sugar, such as whole grains and legumes, can help manage rosacea symptoms."
            },
            "Harmful": {
                "Spicy Foods": "Can trigger flushing and worsen rosacea symptoms.",
                "Hot Beverages": "Coffee and hot tea can cause flare-ups due to increased skin temperature.",
                "Alcohol": "Commonly triggers redness and irritation; especially red wine.",
                "Dairy Products": "Some individuals find that dairy exacerbates their symptoms.",
                "Processed Foods": "High in additives and preservatives, these can contribute to inflammation."
            }
        },
        "Lifestyle": {
            "Sun Protection": "Using a broad-spectrum sunscreen daily helps prevent rosacea flare-ups caused by sun exposure.",
            "Stress Management": "Managing stress through relaxation techniques like yoga or meditation can reduce the frequency of flare-ups.",
            "Gentle Skincare Routine": "Using mild, fragrance-free cleansers and moisturizers can help soothe rosacea-prone skin.",
            "Avoiding Extreme Temperatures": "Both heat and cold can trigger rosacea symptoms, so avoiding extreme temperatures is beneficial."
        }
    },
    "Psoriasis": {
        "Medical Ingredients": {
            "Beneficial": {
                "Topical Corticosteroids": "Reduce inflammation and itching associated with psoriasis.",
                "Vitamin D Analogues (e.g., Calcipotriene)": "Help slow down skin cell growth and reduce scaling.",
                "Retinoids (e.g., Tazarotene)": "Promote cell turnover and help clear plaques.",
                "Coal Tar": "Reduces scaling, itching, and inflammation.",
                "Biologics (e.g., Adalimumab, Etanercept)": "Target specific parts of the immune system to reduce inflammation and plaque formation."
            },
            "Harmful": {
                "Alcohol": "Can trigger or worsen psoriasis symptoms in some individuals.",
                "Fragrance": "Can irritate sensitive skin and exacerbate symptoms.",
                "Strong Exfoliants": "Harsh scrubs and exfoliants can irritate the skin and worsen psoriasis lesions."
            }
        },
        "Diet": {
            "Beneficial": {
                "Anti-Inflammatory Foods": "Foods rich in omega-3 fatty acids, such as fatty fish, flaxseeds, and walnuts, may help reduce inflammation.",
                "Fruits and Vegetables": "High in antioxidants, they support overall health and may reduce inflammation.",
                "Whole Grains": "Foods like brown rice and whole wheat bread can help maintain stable blood sugar levels.",
                "Lean Proteins": "Sources like chicken, turkey, and legumes can help reduce inflammation."
            },
            "Harmful": {
                "Processed Foods": "High in sugars and unhealthy fats, which can increase inflammation.",
                "Refined Carbohydrates": "Foods like white bread and pastries can spike blood sugar levels, worsening symptoms.",
                "Dairy Products": "Some people with psoriasis find that dairy can trigger flare-ups.",
                "Excessive Alcohol": "Can lead to dehydration and worsen psoriasis symptoms."
            }
        },
        "Lifestyle": {
            "Moisturizing Regularly": "Keeping the skin well-hydrated can help reduce itching and flaking.",
            "Stress Management": "Practices like yoga and meditation can help manage stress, which can trigger flare-ups.",
            "Regular Exercise": "Helps improve circulation and reduce inflammation, which may benefit psoriasis.",
            "Avoiding Smoking": "Smoking can worsen psoriasis and trigger flare-ups."
        }
    },
    "Eczema": {
        "Medical Ingredients": {
            "Beneficial": {
                "Topical Corticosteroids": "Reduce inflammation, redness, and itching associated with eczema flare-ups.",
                "Calcineurin Inhibitors (e.g., Tacrolimus, Pimecrolimus)": "Help reduce inflammation and immune response without the side effects of steroids.",
                "Moisturizers (e.g., Ceramide-containing creams)": "Help restore the skin barrier and retain moisture.",
                "Antihistamines": "Can help relieve itching, especially at night."
            },
            "Harmful": {
                "Fragrance": "Can irritate sensitive skin and trigger eczema flare-ups.",
                "Alcohol": "May dry out the skin and worsen eczema symptoms.",
                "Harsh Soaps and Cleansers": "Can strip the skin of its natural oils, exacerbating dryness and irritation."
            }
        },
        "Diet": {
            "Beneficial": {
                "Anti-Inflammatory Foods": "Foods rich in omega-3 fatty acids, such as fatty fish, flaxseeds, and walnuts, may help reduce inflammation.",
                "Fruits and Vegetables": "High in antioxidants and vitamins, they support overall skin health.",
                "Probiotics": "Foods like yogurt and fermented foods can help maintain gut health, which may benefit skin conditions.",
                "Whole Grains": "Help stabilize blood sugar levels and provide essential nutrients."
            },
            "Harmful": {
                "Common Allergens": "Foods like dairy, eggs, peanuts, and soy may trigger eczema in sensitive individuals.",
                "Processed Foods": "High in sugars, unhealthy fats, and additives that can contribute to inflammation.",
                "Spicy Foods": "Can trigger flushing and worsen symptoms for some individuals.",
                "Caffeine": "May lead to dehydration, which can worsen dry skin."
            }
        },
        "Lifestyle": {
            "Moisturizing Regularly": "Keeping the skin well-hydrated with emollients helps maintain the skin barrier.",
            "Avoiding Hot Showers": "Hot water can strip moisture from the skin; lukewarm water is recommended.",
            "Stress Management": "Stress can trigger flare-ups, so practices like mindfulness and relaxation techniques can be beneficial.",
            "Wearing Soft, Breathable Fabrics": "Cotton and soft fabrics can reduce irritation, while rough materials may exacerbate eczema."
        }
    },
    "Uneven pigmentation": {
        "Medical Ingredients": {
            "Beneficial": {
                "Hydroquinone": "Lightens hyperpigmentation by inhibiting melanin production.",
                "Vitamin C (Ascorbic Acid)": "Brightens skin tone and reduces the appearance of dark spots by inhibiting melanin production.",
                "Retinoids (e.g., Tretinoin)": "Promote cell turnover and help fade dark spots.",
                "Azelaic Acid": "Helps to even out skin tone and reduces inflammation.",
                "Kojic Acid": "Inhibits melanin production and helps lighten pigmentation.",
                "Niacinamide": "Reduces the appearance of dark spots and improves skin barrier function."
            },
            "Harmful": {
                "Fragrance": "Can irritate sensitive skin and trigger inflammation.",
                "Alcohol": "Can dry out the skin and worsen pigmentation issues.",
                "Strong Exfoliants": "Harsh scrubs or high concentrations of acids can irritate the skin and worsen pigmentation."
            }
        },
        "Diet": {
            "Beneficial": {
                "Antioxidant-Rich Foods": "Foods like berries, citrus fruits, and green leafy vegetables help combat oxidative stress and promote skin health.",
                "Healthy Fats": "Omega-3 fatty acids from fatty fish, flaxseeds, and walnuts support skin barrier function.",
                "Vitamins A and C": "Carrots, sweet potatoes, and bell peppers support skin health and may help with pigmentation.",
                "Zinc-Rich Foods": "Foods like nuts and seeds support skin healing and may help improve uneven pigmentation."
            },
            "Harmful": {
                "High Sugar Foods": "Excess sugar can lead to inflammation and worsen pigmentation.",
                "Processed Foods": "Often high in additives and preservatives, which can promote inflammation.",
                "Dairy Products": "May contribute to skin issues in some individuals and exacerbate pigmentation problems."
            }
        },
        "Lifestyle": {
            "Sun Protection": "Daily use of broad-spectrum sunscreen helps prevent further pigmentation and protects against UV damage.",
            "Consistent Skincare Routine": "A routine that includes gentle exfoliation and brightening products can help manage pigmentation.",
            "Hydration": "Drinking plenty of water supports overall skin health and may improve pigmentation.",
            "Avoiding Smoking": "Smoking can exacerbate skin issues and contribute to uneven pigmentation."
        }
    },
    "Wrinkles": {
        "Medical Ingredients": {
            "Beneficial": {
                "Retinoids (e.g., Tretinoin)": "Promote cell turnover and collagen production, helping to reduce the appearance of fine lines and wrinkles.",
                "Hyaluronic Acid": "Provides intense hydration, plumping the skin and reducing the appearance of wrinkles.",
                "Peptides": "Stimulate collagen production and improve skin elasticity.",
                "Vitamin C (Ascorbic Acid)": "Brightens skin and helps in collagen synthesis, reducing the appearance of wrinkles.",
                "Alpha Hydroxy Acids (AHAs, e.g., Glycolic Acid)": "Exfoliate the surface of the skin, promoting cell turnover and improving skin texture."
            },
            "Harmful": {
                "Fragrance": "Can irritate sensitive skin and contribute to inflammation.",
                "Alcohol": "Can excessively dry out the skin, leading to increased visibility of wrinkles.",
                "Harsh Exfoliants": "Strong scrubs or high concentrations of acids can irritate the skin, potentially worsening the appearance of wrinkles."
            }
        },
        "Diet": {
            "Beneficial": {
                "Antioxidant-Rich Foods": "Foods like berries, dark chocolate, and green leafy vegetables protect against oxidative stress and promote skin health.",
                "Healthy Fats": "Omega-3 fatty acids found in fatty fish, flaxseeds, and walnuts help maintain skin elasticity.",
                "Vitamin C-Rich Foods": "Citrus fruits, bell peppers, and kiwi support collagen production and skin repair.",
                "Hydrating Foods": "Fruits and vegetables with high water content, like cucumbers and watermelon, help keep the skin hydrated."
            },
            "Harmful": {
                "Excess Sugar": "High sugar intake can lead to glycation, which damages collagen and elastin, contributing to wrinkles.",
                "Processed Foods": "Often high in unhealthy fats and additives, which can promote inflammation and accelerate aging.",
                "Alcohol": "Excessive alcohol can lead to dehydration and make wrinkles more prominent."
            }
        },
        "Lifestyle": {
            "Sun Protection": "Daily use of broad-spectrum sunscreen protects against UV damage, which can accelerate skin aging and wrinkle formation.",
            "Hydration": "Drinking plenty of water helps maintain skin moisture and elasticity.",
            "Consistent Skincare Routine": "Using anti-aging products regularly can help improve skin texture and reduce the appearance of wrinkles.",
            "Avoiding Smoking": "Smoking accelerates skin aging and contributes to wrinkle formation."
        }
    }
}