{
    "GENERAL": {
        "Ceramides": "Ceramides are lipids that naturally occur in the skin's barrier and are essential for replenishing moisture and protecting against environmental damage.",
        "Hyaluronic Acid": "Hyaluronic acid is a potent humectant that draws moisture into the skin, enhancing hydration and plumping to reduce fine lines.",
        "Cholesterol": "Cholesterol works with fatty acids and ceramides to strengthen the skin barrier, restoring and maintaining its protective functions.",
        "Fatty Acids": "Fatty acids, including omega-3 and omega-6, are vital for restoring and maintaining the lipid layer, thereby enhancing the skin's resilience.",
        "Niacinamide": "Niacinamide improves the skin's barrier function by boosting ceramide and fatty acid production, enhancing moisture retention and reducing inflammation.",
        "Glycerin": "Glycerin attracts water to the skin and helps maintain barrier integrity, protecting against irritants and enhancing hydration.",
        "Panthenol": "Panthenol soothes and replenishes the skin barrier while improving hydration, elasticity, and smoothness through its anti-inflammatory properties.",
        "Squalane": "Squalane mimics natural sebum, acting as an excellent moisturizer that replenishes the skin barrier and enhances suppleness."
    },
    "S. capitis": {
        "Niacinamide": "Increases ceramide synthesis that results in a stronger, healthier skin barrier and better skin hydration.",
        "Ceramides": "The glue that holds our skin cells together to keep our skin barrier intact and healthy.",
        "Tea Tree Oil": "Damage extracellular matrix and disrupt adherence to reduce S. capitis population.",
        "Grape seed extract (Proanthocyanidins)": "Supresses baceterial adhesion due to electrostatic repulsion to reduce S. capitis population.",
        "Oregano oil, Thymol, Carvacrol": "Interfers with bacterial communication, gene express, and cell adhesion to reduce S. capitis population."
    },
    "S. aureus": {
        "Non-foaming Cleansers": "Does not alkalinize the skin. In atopic dermatitis, the acid mantle is especially important in infection prevention. Non-foaming cleansers also include mild surfactants with reduced ability to disrupt the intercellular lipids",
        "Ceramides": "Help to rebuild and strengthen the skin's barrier, preventing moisture loss and protecting against environmental damage.",
        "Triglycerides": "Act as an emollient, enhancing the skin’s ability to retain moisture and soften the skin.",
        "Cholesterol": "Supports skin barrier function and improves elasticity.",
        "Free fatty acids": "Provide nourishing properties and help to restore the lipid layer.",
        "Phenylpropanol": "Has antimicrobial activity, particularly against S. aureus.",
        "Propanediol": "Acts as a solvent and humectant, boosting the skin's moisture without interfering with beneficial bacteria.",
        "Caprylyl glycol:": "Possesses antimicrobial properties while also acting as a conditioning agent.",
        "Tocopherol (Vitamin E)": "Has antioxidant properties, protecting skin cells from oxidative stress.",
        "Disodium EDTA": "Helps in preserving the formulation and enhances the efficacy of other active ingredients."
    },
    "S. epidermidis": {
        "Hydroxyacetophenone": "Provides soothing and anti-inflammatory benefits, helping to calm irritated skin.",
        "Phenylpropanol": "Acts as a fragrance and preservative, enhancing the product's scent while preventing microbial growth.",
        "Propanediol": "Hydrates the skin, creating a favorable environment for beneficial microbes to thrive and maintain a balanced microbiome.",
        "Caprylyl Glycol": "Moisturizes and supports a healthy skin barrier, which can promote a diverse and resilient microbiome.",
        "Tocopherol": "Protects the skin from oxidative stress, which can negatively impact microbiome health, thus promoting a balanced ecosystem.",
        "Tetrasodium Glutamate Diacetate": "Enhances formulation stability, ensuring that preservatives effectively protect against harmful microbes without disrupting beneficial ones.",
        "Sodium Benzoate": "Prevents the growth of harmful microorganisms in skincare products, promoting a safe environment for beneficial skin microbes.",
        "Phenoxyethanol": "Protects formulations from contamination, allowing the skin’s natural microbiome to flourish without interference from harmful bacteria.",
        "Ethylhexylglycerin": "Acts as a moisturizer and preservative booster, helping to maintain skin hydration and support a healthy microbial environment.",
        "Sodium Anisate": "Provides natural antimicrobial properties, helping to preserve the integrity of skincare products.",
        "1,2-Hexanediol": "Enhances moisture retention and helps create a suitable environment for beneficial microbes to thrive on the skin.",
        "Disodium EDTA": "Stabilizes formulations, allowing effective preservation against harmful microbes while minimizing impact on beneficial skin flora.",
        "Benzyl Alcohol": "Acts as a preservative to protect formulations from harmful microbes, thereby supporting a healthy balance in the skin microbiome.",
        "Benzoic Acid": "Provides natural preservation, preventing spoilage and ensuring that beneficial microbes are not negatively affected.",
        "Dehydroacetic Acid": "Protects against microbial growth while being gentle on the skin, supporting a diverse and healthy microbiome.",
        "Potassium Sorbate": "Inhibits the growth of mold and yeast, protecting products and allowing the skin’s natural microbiome to thrive."
    },
    "C. acnes": {
        "Levulinic Acid": "A natural preservative with antimicrobial properties that enhances skin barrier function and prevents infections.",
        "Salicylic Acid": "A beta hydroxy acid that penetrates pores to exfoliate the skin and effectively treat acne by reducing inflammation and preventing clogged pores.",
        "Benzoyl Peroxide": "A potent antibacterial agent that kills acne-causing bacteria and reduces oil production, helping to prevent breakouts.",
        "Azelaic Acid": "An anti-inflammatory and antibacterial compound that treats acne and rosacea by improving skin texture and reducing redness."
    },
    "C. striatum": "GENERAL",
    "C. kroppenstedtii": "GENERAL",
    "C. tuberculostearicum": "GENERAL",
    "C. avidum": "GENERAL",
    "C. granulosum": "GENERAL",
    "S. haemolyticus": "GENERAL",
    "S. hominis": "GENERAL"
}